Config/Reports/РасчетСреднегодовойСтоимостиИмущества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>РасчетСреднегодовойСтоимостиИмущества</Name>
		</Properties>
	</Report>
</MetaDataObject>

Config/Enums/ВидыНФА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыНФА</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НМА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НПА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапВложения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПраваПользованияИмуществом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Казна</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/Подразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Подразделения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВедетсяКассоваяКнига</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment> Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленнаяНумерацияДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Comment>Подразделение является обособленным</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦифровойИндекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОрганаФСГС</Name>
					<Comment>Код территориального органа государственной статистики </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Reports/РасчетСреднегодовойСтоимостиИмущества/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Рассчитывает стоимость ОС помесячно
// 
// Параметры:
//  НачалоПериода 	 - Дата
//  КонецПериода 	 - Дата
//  РабочиеНастройки - НастройкиКомпоновкиДанных
//  				 - СправочникСсылка.Организации
//  ДопПараметры - Структура:
//       				* ВидыНФА - Массив из ПеречислениеСсылка.ВидыНФА - Виды НФА, по которым будет рассчитываеться среднегодовая стоимость
//       				* ИмуществоКазны - Булево - если Истина, то будет рассчитываться стоимость имущества казны
//       				* РасчетНалогаНаИмущество - Булево - если Истина, основной набор для расчета налога на имущество
//
// Возвращаемое значение:
//   ТаблицаЗначений   - см. ТаблицаОсновногоНабора()
//
Функция ОсновнойНаборДанных(НачалоПериода, КонецПериода, РабочиеНастройки = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	МассивПериодов = Новый Массив;
	
	Годы	= Год(КонецПериода) - Год(НачалоПериода);
	Месяцы	= Месяц(КонецПериода) - Месяц(НачалоПериода);
	
	КоличествоМесяцев = Месяцы + Годы * 12 + 1;
	
	Для Счетчик = 0 По КоличествоМесяцев - 1 Цикл
		Период = НачалоМесяца(ДобавитьМесяц(НачалоПериода, Счетчик));
		Если Счетчик = 12 Тогда
			Период = Новый Граница(Период - 1, ВидГраницы.Включая);
		КонецЕсли;
		МассивПериодов.Добавить(Период);
	КонецЦикла;
	
	ТаблицаРезультат = ТаблицаОсновногоНабора();
	
	СхемаКомпоновки = Отчеты.РасчетСреднегодовойСтоимостиИмущества.ПолучитьМакет("ДанныеЗаМесяц");
	
	УчетПоПодразделениям = УправлениеОсновнымиСредствамиПовтИсп.ВедетсяУчетОСПоПодразделениям();
	Если Не УчетПоПодразделениям Тогда
		ТекстЗапроса = СхемаКомпоновки.НаборыДанных["ОсновнойНабор"].Запрос;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СтоимостьОбъектовОСОстатки.Подразделение", "Значение(Справочник.Подразделения.ПустаяСсылка)");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ", (Подразделение).* КАК Подразделение", "");
		СхемаКомпоновки.НаборыДанных["ОсновнойНабор"].Запрос = ТекстЗапроса;
	КонецЕсли;
	
	НастройкиСхемы = Новый КомпоновщикНастроекКомпоновкиДанных;
	НастройкиСхемы.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки));
	НастройкиСхемы.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
	
	Если ТипЗнч(РабочиеНастройки)  = Тип("СправочникСсылка.Организации") Тогда
		Если ЗначениеЗаполнено(РабочиеНастройки) Тогда
			ОбщийМодульСКД.ДобавитьЭлементОтбораКомпоновкиДанных(НастройкиСхемы.Настройки.Отбор, "Организация",, РабочиеНастройки);
		КонецЕсли;
	Иначе
		ОбщийМодульСКД.СкопироватьОтборНастроекКомпоновкиДанных(НастройкиСхемы.Настройки.Отбор, РабочиеНастройки.Отбор);
		НастройкиСхемы.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	КонецЕсли;
	
	ВидыНФА = Новый Массив;
	ВидыНФА.Добавить(ПредопределенноеЗначение("Перечисление.ВидыНФА.ОС"));
	
	Если ДопПараметры <> Неопределено Тогда
		
		Если ДопПараметры.Свойство("ВидыНФА") Тогда
			ВидыНФА = ДопПараметры.ВидыНФА;
		КонецЕсли;	

		Если ДопПараметры.Свойство("ИмуществоКазны") И ДопПараметры.ИмуществоКазны Тогда
			ТекстЗапроса = СхемаКомпоновки.НаборыДанных["ОсновнойНабор"].Запрос;
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НЕ ОсновныеСредства.ИмуществоКазны", "ОсновныеСредства.ИмуществоКазны");
			СхемаКомпоновки.НаборыДанных["ОсновнойНабор"].Запрос = ТекстЗапроса;
		КонецЕсли;
		
		Если ДопПараметры.Свойство("РасчетНалогаНаИмущество") И ДопПараметры.РасчетНалогаНаИмущество Тогда
			НастроитьПоляДанныеЗаМесяцДляРасчетаНалогаНаИмущество(НастройкиСхемы.Настройки.Выбор);
		КонецЕсли;
			
	КонецЕсли;	
	НастройкиСхемы.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидыНФА", ВидыНФА);
	
	Для Каждого Период Из МассивПериодов Цикл
		
		ПериодСтавок = ?(ТипЗнч(Период) = Тип("Граница"), Период.Значение, КонецДня(Период));
		
		НастройкиСхемы.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", Период);
		НастройкиСхемы.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодСтавок", ПериодСтавок);
		
		ТаблицаЗаМесяц = ПолучитьДанныеЗаМесяц(СхемаКомпоновки, НастройкиСхемы.Настройки);
		
		Для Каждого СтрокаТаблицы Из ТаблицаЗаМесяц Цикл
			НоваяСтрока = ТаблицаРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.Период = ?(ТипЗнч(Период) = Тип("Граница"), Период.Значение, Период);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации()
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       см. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ВариантОтчет");
	НастройкиВарианта.Описание = "";
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ВариантРасчет");
	НастройкиВарианта.Включен = Ложь;
	
КонецПроцедуры

Функция СвойстваОбъектаДляРасшифровкиСтандартнымиОтчетами(ОтчетОбъект) Экспорт
	
	ТекущиеНастройки = ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	ПериодОтчета = ТекущиеНастройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета")).Значение;
	
	СвойстваОбъекта = Новый Структура;
	
	МассивОтчетов = Новый Массив;
	МассивОтчетов.Добавить("ОборотноСальдоваяВедомостьПоСчету");
	МассивОтчетов.Добавить("АнализСубконто");
	МассивОтчетов.Добавить("КарточкаСчета");
	МассивОтчетов.Добавить("КарточкаСубконто");
	СвойстваОбъекта.Вставить("ОтчетыРасшифровки", МассивОтчетов);
	
	СписокВидовСубконто = Новый СписокЗначений;
	СписокВидовСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства);
	СвойстваОбъекта.Вставить("СписокВидовСубконто", СписокВидовСубконто);
	
	МассивОсновныхДействий = Новый Массив;
	МассивОсновныхДействий.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	МассивОсновныхДействий.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Расшифровать);
	МассивОсновныхДействий.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Сгруппировать);
	
	СвойстваОбъекта.Вставить("МассивОсновныхДействий", МассивОсновныхДействий);
	
	РазрешенныеОтборы = Новый Массив;
	РазрешенныеОтборы.Добавить("Организация");
	РазрешенныеОтборы.Добавить("ОсновноеСредство");
	РазрешенныеОтборы.Добавить("КПС");
	РазрешенныеОтборы.Добавить("КФО");
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям")
		И БухгалтерскийУчетПовтИсп.ПолучитьПризнакиУчета("101.00").УчетПоПодразделениям Тогда
		РазрешенныеОтборы.Добавить("Подразделение");
	КонецЕсли;
	РазрешенныеОтборы.Добавить("ИФО");
	
	СвойстваОбъекта.Вставить("МассивРазрешенныхОтборов", РазрешенныеОтборы);
	
	Возврат СвойстваОбъекта;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТаблицаОсновногоНабора()
	
	// итоговая таблица
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	Колонки = ТаблицаРезультат.Колонки;
	
	Колонки.Добавить("Организация"				, Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Колонки.Добавить("ОсновноеСредство"			, Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	Колонки.Добавить("ИнвентарныйНомер"			, Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	
	Колонки.Добавить("ИФО"						, Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	Колонки.Добавить("КФО"						, Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	Колонки.Добавить("КПС"						, Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	Колонки.Добавить("Счет"						, Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	Колонки.Добавить("ЭтоНедвижимое"			, Новый ОписаниеТипов("Булево"));
	
	Колонки.Добавить("ЦМО"						, Новый ОписаниеТипов("СправочникСсылка.ЦМО"));
	Колонки.Добавить("Подразделение"			, Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	Колонки.Добавить("СуммаБаланс"				, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18,2)));
	Колонки.Добавить("СуммаАмортизации"			, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18,2)));
	Колонки.Добавить("СуммаОбесценения"			, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18,2)));
	Колонки.Добавить("СуммаОстаток"				, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18,2)));
	Колонки.Добавить("Количество"				, Новый ОписаниеТипов("Число"));
	
	Колонки.Добавить("НалоговыйОрган"			, Новый ОписаниеТипов("СправочникСсылка.РегистрацииВНалоговомОргане"));
	Колонки.Добавить("КодПоОКАТО"				, Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(11)));
	Колонки.Добавить("НалоговаяБаза"			, Новый ОписаниеТипов("ПеречислениеСсылка.НалоговаяБазаПоНалогуНаИмущество"));
	Колонки.Добавить("НалоговаяСтавка"			, Новый ОписаниеТипов("Число"));
	Колонки.Добавить("КодВидаИмущества"			, Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(2)));
	Колонки.Добавить("ПорядокНалогообложения"	, Новый ОписаниеТипов("ПеречислениеСсылка.ПорядокНалогообложенияИмущества"));
	Колонки.Добавить("КодНалоговойЛьготыОсвобождениеОтНалогообложения", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(7)));
	Колонки.Добавить("КодОснованияЛьготы"       , Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(12)));
	Колонки.Добавить("ПроцентУменьшенияСуммыНалога", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7, 4)));
	Колонки.Добавить("СуммаУменьшенияСуммыНалога", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0)));
	
	Колонки.Добавить("ДоляСтоимостиЧислитель"	, Новый ОписаниеТипов("Число"));
	Колонки.Добавить("ДоляСтоимостиЗнаменатель"	, Новый ОписаниеТипов("Число"));
	Колонки.Добавить("ДоляВПравеОбщейСобственностиЧислитель"	, Новый ОписаниеТипов("Число"));
	Колонки.Добавить("ДоляВПравеОбщейСобственностиЗнаменатель"	, Новый ОписаниеТипов("Число"));
	
	Колонки.Добавить("ДатаПринятияКУчету"		, Новый ОписаниеТипов("Дата"));
	Колонки.Добавить("Период"					, Новый ОписаниеТипов("Дата"));
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Процедура НастроитьПоляДанныеЗаМесяцДляРасчетаНалогаНаИмущество(ВыбранныеПоля)

	ВыбранныеПоля.Элементы.Очистить();
	ОбщийМодульСКД.ДобавитьВыбранноеПолеКомпоновкиДанных(ВыбранныеПоля, "Организация");
	ОбщийМодульСКД.ДобавитьВыбранноеПолеКомпоновкиДанных(ВыбранныеПоля, "ОсновноеСредство");
	ОбщийМодульСКД.ДобавитьВыбранноеПолеКомпоновкиДанных(ВыбранныеПоля, "ИнвентарныйНомер");
	ОбщийМодульСКД.ДобавитьВыбранноеПолеКомпоновкиДанных(ВыбранныеПоля, "СуммаОстаток");
	ОбщийМодульСКД.ДобавитьВыбранноеПолеКомпоновкиДанных(ВыбранныеПоля, "НалоговыйОрган");
	ОбщийМодульСКД.ДобавитьВыбранноеПолеКомпоновкиДанных(ВыбранныеПоля, "КодПоОКАТО");
	ОбщийМодульСКД.ДобавитьВыбранноеПолеКомпоновкиДанных(ВыбранныеПоля, "НалоговаяСтавка");
	ОбщийМодульСКД.ДобавитьВыбранноеПолеКомпоновкиДанных(ВыбранныеПоля, "КодВидаИмущества");
	ОбщийМодульСКД.ДобавитьВыбранноеПолеКомпоновкиДанных(ВыбранныеПоля, "ПорядокНалогообложения");
	ОбщийМодульСКД.ДобавитьВыбранноеПолеКомпоновкиДанных(ВыбранныеПоля, "КодНалоговойЛьготыОсвобождениеОтНалогообложения");
	ОбщийМодульСКД.ДобавитьВыбранноеПолеКомпоновкиДанных(ВыбранныеПоля, "КодОснованияЛьготы");
	ОбщийМодульСКД.ДобавитьВыбранноеПолеКомпоновкиДанных(ВыбранныеПоля, "ПроцентУменьшенияСуммыНалога");
	ОбщийМодульСКД.ДобавитьВыбранноеПолеКомпоновкиДанных(ВыбранныеПоля, "СуммаУменьшенияСуммыНалога");
	ОбщийМодульСКД.ДобавитьВыбранноеПолеКомпоновкиДанных(ВыбранныеПоля, "ДоляСтоимостиЧислитель");
	ОбщийМодульСКД.ДобавитьВыбранноеПолеКомпоновкиДанных(ВыбранныеПоля, "ДоляСтоимостиЗнаменатель");
	ОбщийМодульСКД.ДобавитьВыбранноеПолеКомпоновкиДанных(ВыбранныеПоля, "Период");

КонецПроцедуры

Функция ПолучитьДанныеЗаМесяц(СхемаКомпоновки, Настройки)
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки,
		Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Новый ТаблицаЗначений);
	
	Возврат ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецФункции

#КонецОбласти

#КонецЕсли
